In [18]:
import pandas as pd 
import numpy as np
# assign data : disctionary 
data = {
    "Name" : ["arp", "Man", "joy", "Roh", "Virt", "shery"],
    "Age" : [30, 35, 37, 33, 34, 30],
    "Salary" : [100000, 93000, 88000, 120000, 94000, 95000], 
    "Designation" : ["Engineer", "Artist", "Painter", "Singer", "Designer", "Dancer"]
}

df = pd.DataFrame(data)
df

    Name  Age  Salary Designation
0    arp   30  100000    Engineer
1    Man   35   93000      Artist
2    joy   37   88000     Painter
3    Roh   33  120000      Singer
4   Virt   34   94000    Designer
5  shery   30   95000      Dancer

In [11]:
# Q1 : display name, age of employee where salary is less than mean salary ? #
# 1. find mean() 
# 2. filter criteria : less than mean salary 
# 3. select required columns

In [12]:
df["Salary"].mean()

np.float64(83333.33333333333)

In [19]:
avg_salary = df["Salary"].mean()
avg_salary

np.float64(98333.33333333333)

In [20]:
df["Salary"] < df["Salary"].mean()

0    False
1     True
2     True
3    False
4     True
5     True
Name: Salary, dtype: bool

In [24]:
df.loc[ df["Salary"] < df["Salary"].mean() , ["Name", "Age"]]

    Name  Age
1    Man   35
2    joy   37
4   Virt   34
5  shery   30

In [25]:
df.loc[2]

Name               joy
Age                 37
Salary           88000
Designation    Painter
Name: 2, dtype: object

In [27]:
df.loc[[0,1]] # prints the first + second employee in the df

  Name  Age  Salary Designation
0  arp   30  100000    Engineer
1  Man   35   93000      Artist

In [28]:
# Q2 : display name, age where salary is > 100000 & age is less than 32 :

In [33]:
df.loc[ (df["Salary"] >= 100000) & (df["Age"] < 32) , ["Name", "Age"]] # TWO filter conditions :

  Name  Age
0  arp   30

In [34]:
# Q3 : add new column (salary_after5) and multiply salary by factor of 1.5

In [35]:
df["Salary_after5"] = df["Salary"] * 1.5

In [ ]:
df

In [ ]:
# OR : df["Salary_after5"] = df.appy(lambda x:x["Salary"] * 1.5, axis=1)